# CSCI_4230_PL_11_9_2018.md
Haskell Assingment Q's
```haskell
Prelude> :t Nothing
--Nothing :: Maybe a
```
```haskell
Prelude> :type Nothing
--Nothing :: Maybe a
```
```haskell
Prelude> :type Just 4
-- Just 4 :: Num a => Empty
```
```haskell
Prelude> :t Empty
-- Error
```
```haskell
Prelude> data BinTree a = Empty | Node a (BinTree a) (BinTree a)
```
```haskell
Prelude> :t Node
-- Error
```
```haskell
Prelude> :t Empty
-- Error :: Empty
```
```haskell
Prelude> treeSize (Node _ left right) = 1 + (treeSize left) + (treeSize right)
-- Error
```
```haskell
Prelude> :treeSize Node
-- 0
```
```haskell
Prelude> :treeSize BinTree a
-- 1
```
---

### The resolution principle

```prolog
takes(nancy, csci4270).
takes(nancy, csci4350).
takes(james, csci3603).
takes(james, csci4270).
```

These are 4 FACTS, to that we will add a rule


```prolog
takes(nancy, csci4270).
takes(nancy, csci4350).
takes(james, csci3603).
takes(james, csci4270).
classmates(X, Y) :- takes(X, Z), takes(Y, Z)
```

Example data

```
C_1 = takes(nancy, csci4270)
C_2 = classmates(X, Y) :- takes(X, Z), takes(Y, Z).
```

resolution gives us a new clause

x is bound to nancy
y is bound to csci4270

```
C_3 = classmates(X, Y) :- takes(Y,Z).
```

### Unification
Unification uses essentially 3 rules

* A constant unifies only with itself
* Two structures unify if
  * they have the same functer
  * they have the same arity (number of args)
  * they corresponding arguments also unify
* A variable unifies with anything with restructions
  * if the other thing that a variable is unified with has a value, the variable is instantiated to that value
  * if the other thing is also an uninstantiated variable, those two variables become associated so that if one is later instantiated, the other is instantiated to the same value

```prolog
?- a = a.

- true
```

```prolog
?- a = b.

- false
```

```prolog
?- foo(a,b) = foo(a,b)

- true
```

```prolog
?- foo(a,b) = foo(a,b)

- true
```

```prolog
X = a
?- foo(a,b) = foo(a,b)

- true
```


```prolog
?- X = [a | [b,c] ]
|
X = [a,b,c]
- true
```

operators on lists

```prolog
?- member(2, [1,2,3]).

-- true
```

define our own

* Underscore is special
  * binds to anythin
  * creates no binding
  * anything starting with underscore has this prop

```prolog
isMember(Item, [Item, _ ]).
isMember(Item, [_ | Tail]) :- isMember(Item ,Tail).
```

### Two instances to prove

```prolog
?- member(2, [2, 3, 4, 2])
true;
true;
false.
```

## Prolog "isSorted?"

```prolog
isSorted([]).
isSorted([_]).
isSorted([First, Second | Tail]) :- First =< Second, isSorted([Second | Tail]).
```

Test

```prolog
?- isSorted([]).
true.

?- isSorted([_]).
true.

?- isSorted([3,2]).
false.

?- isSorted([1,2,3,4,5,7])
true.
```

## doAppend

```prolog
doAppend([], List, List)
doAppend([Head | Tail], List, [Head | NewTail]) :- doAppend(Tail, List, NewTail)
```

Results (run it!)

```prolog
doAppend([a,b,c], [d,e,f], Result)
Result = [a,b,c,d,e,f]
```

Also you can ask it is there something I can get to produce another thing

```prolog
doAppend(First, [d,e], [a,b,c,d,e]).
First = [a,b,c]
```

```prolog
doAppend(First, [d,e], [a,b,c,d,e]).
First = [a,b,c]
false.
```

```prolog
doAppend(First, [d,e], [a,b,c,e]).
false.
```
Find all possible combos
```prolog
doAppend(First, Second, [a,b,c,e]).
First = [];
Second = [a,b,c,e]
First = [a];
Second = [b,c,e]
First = [a,b];
Second = [c,e]
First = [a,b,c];
Second = [e]
First = [a,b,c,e];
Second = []
false.
```
